Перем ЗначениеПриОткрытии;


Процедура КнопкаВыполнитьНажатие(Элемент)
	Модифицированность = Ложь;
	Закрыть(Истина);
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если Модифицированность Тогда
		Вопрос = НСтр("ru='Настройки были изменены! Сохранить изменения?';uk='Настройки були змінені! Зберегти зміни?'");
		Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ДаНетОтмена);

		Если      Ответ = КодВозвратаДиалога.Да Тогда
			Модифицированность = Ложь;
			Закрыть(Истина);
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Отказ = Истина;
		Иначе
			Модифицированность = Ложь;
			Закрыть(Неопределено);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

